## 7.2	Data	Transformation

In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

### Removing	Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data['v1'] = range(7)

In [7]:
# deduplicates assigned column

data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [10]:
# in default , pands will remove the last replicat one
# but if you assign keep=last, it'll remove the other one
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming	Data	Using	a	Function	or	Mapping

In [11]:
data = pd.DataFrame({
    'food': 'bacon pulled_pork bacon pastrima corned_beef bacon'.split(),
    'onuces': range(6)
})

In [12]:
data

          food  onuces
0        bacon       0
1  pulled_pork       1
2        bacon       2
3     pastrima       3
4  corned_beef       4
5        bacon       5

In [13]:
# add a related column
meat_to_animals = {
    'bacon': 'pig',
    'pulled_pork': 'pig',
    'pastrima': 'cow',
    'corned_beef': 'cow'
}

In [14]:
food_column = data['food'].str.lower()

In [15]:
food_column

0          bacon
1    pulled_pork
2          bacon
3       pastrima
4    corned_beef
5          bacon
Name: food, dtype: object

In [16]:
data['animal'] = food_column.map(meat_to_animals)

In [17]:
data

          food  onuces animal
0        bacon       0    pig
1  pulled_pork       1    pig
2        bacon       2    pig
3     pastrima       3    cow
4  corned_beef       4    cow
5        bacon       5    pig

In [18]:
# lambda
data['food'].map(lambda x: meat_to_animals[x.lower()])

0    pig
1    pig
2    pig
3    cow
4    cow
5    pig
Name: food, dtype: object

### Replacing	Values

In [19]:
data = pd.Series([1, -999, 3, -999, 5, -1000])

In [20]:
data

0       1
1    -999
2       3
3    -999
4       5
5   -1000
dtype: int64

In [21]:
data.replace(-999, NA)

0       1.0
1       NaN
2       3.0
3       NaN
4       5.0
5   -1000.0
dtype: float64

In [22]:
data.replace([-999, -1000], NA)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
5    NaN
dtype: float64

In [23]:
data.replace([-999, -1000], [NA, 222])

0      1.0
1      NaN
2      3.0
3      NaN
4      5.0
5    222.0
dtype: float64

### Renaming	Axis	Indexes

In [24]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index='Ohio Colorado New_York'.split(),
                   columns='one two three four'.split())

In [25]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New_York    8    9     10    11

In [26]:
transform = lambda x: x[:4].upper()

In [27]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW_'], dtype='object')

In [28]:
data.index = data.index.map(transform)

In [29]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW_    8    9     10    11

In [30]:
# rename
# will not alter original data

data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New_    8    9     10    11

In [31]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW_    8    9     10    11

In [32]:
# note, you also can use a dict-like obj

data.rename(index={'OHIO': 'LOS'}, columns={'one': 'five'})

      five  two  three  four
LOS      0    1      2     3
COLO     4    5      6     7
NEW_     8    9     10    11

### Discretization	and	Binning

In [33]:
import random

In [36]:
ages = random.sample(range(18, 70), 12)

In [37]:
ages

[22, 57, 27, 23, 61, 29, 62, 64, 33, 69, 59, 26]

In [38]:
bins = [18, 25, 60, 100]

In [39]:
cats = pd.cut(ages, bins)

In [40]:
cats

[(18, 25], (25, 60], (25, 60], (18, 25], (60, 100], ..., (60, 100], (25, 60], (60, 100], (25, 60], (25, 60]]
Length: 12
Categories (3, interval[int64]): [(18, 25] < (25, 60] < (60, 100]]

In [42]:
cats.codes

array([0, 1, 1, 0, 2, 1, 2, 2, 1, 2, 1, 1], dtype=int8)

In [43]:
cats.categories

IntervalIndex([(18, 25], (25, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [44]:
pd.value_counts(cats)

(25, 60]     6
(60, 100]    4
(18, 25]     2
dtype: int64

In [45]:
# assign open or closed
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [36, 61), [26, 36), [18, 26), [61, 100), ..., [61, 100), [26, 36), [61, 100), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [46]:
# pass own category names
group_names = ['youth', 'youthadult', 'middleage', 'senior']

In [47]:
pd.cut(ages, [18, 26, 36, 61, 100], labels=group_names)

[youth, middleage, youthadult, youth, middleage, ..., senior, youthadult, senior, middleage, youth]
Length: 12
Categories (4, object): [youth < youthadult < middleage < senior]

In [48]:
# another bins type 

data = np.random.rand(20)

In [49]:
pd.cut(data, 4, precision=2)

[(0.012, 0.24], (0.47, 0.69], (0.012, 0.24], (0.012, 0.24], (0.012, 0.24], ..., (0.47, 0.69], (0.69, 0.92], (0.69, 0.92], (0.47, 0.69], (0.24, 0.47]]
Length: 20
Categories (4, interval[float64]): [(0.012, 0.24] < (0.24, 0.47] < (0.47, 0.69] < (0.69, 0.92]]

In [51]:
# the '4' will divide range(min(data), max(data)) into 4 parts

In [52]:
# qcut 
# aim to divide data into same qutities
data = np.random.rand(1000)

In [53]:
cats = pd.qcut(data, 4)

In [54]:
pd.value_counts(cats)

(0.739, 0.997]        250
(0.483, 0.739]        250
(0.212, 0.483]        250
(-0.000174, 0.212]    250
dtype: int64

In [56]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

In [57]:
cats

[(0.0898, 0.483], (0.0898, 0.483], (0.0898, 0.483], (0.483, 0.906], (0.0898, 0.483], ..., (0.0898, 0.483], (0.0898, 0.483], (0.0898, 0.483], (0.0898, 0.483], (0.0898, 0.483]]
Length: 1000
Categories (4, interval[float64]): [(-0.000174, 0.0898] < (0.0898, 0.483] < (0.483, 0.906] < (0.906, 0.997]]

In [58]:
pd.value_counts(cats)

(0.483, 0.906]         400
(0.0898, 0.483]        400
(0.906, 0.997]         100
(-0.000174, 0.0898]    100
dtype: int64

### Detecting	and	Filtering	Outliers

In [59]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [60]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027474     0.067820    -0.007079     0.067007
std       0.975134     0.984727     0.988851     1.019392
min      -2.849527    -2.935413    -3.052232    -2.922863
25%      -0.686516    -0.614978    -0.676147    -0.630592
50%      -0.026039     0.088320    -0.027009     0.080006
75%       0.623829     0.755543     0.656229     0.774980
max       2.941102     3.489681     3.424285     3.456453

In [61]:
col = data[2]

In [62]:
col[np.abs(col) > 3]

838    3.424285
931   -3.052232
Name: 2, dtype: float64

In [63]:
# select row which at least have one value exceeding 3 or -3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
32   0.070568  0.425533  0.721956  3.456453
736  0.695774  3.489681  0.194422  1.424758
750 -1.548108  3.003178  2.784315 -0.419041
838  0.221667  1.051947  3.424285  0.065870
931  0.381118 -1.595312 -3.052232 -0.407326

In [64]:
# 

data[np.abs(data) > 3] = np.sign(data) * 3

In [65]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027474     0.067327    -0.007451     0.066550
std       0.975134     0.983134     0.987308     1.017974
min      -2.849527    -2.935413    -3.000000    -2.922863
25%      -0.686516    -0.614978    -0.676147    -0.630592
50%      -0.026039     0.088320    -0.027009     0.080006
75%       0.623829     0.755543     0.656229     0.774980
max       2.941102     3.000000     3.000000     3.000000

In [66]:
# np.sign

In [67]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0  1.0  1.0

### Permutation	and	Random	Sampling

In [68]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

In [69]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [70]:
sampler = np.random.permutation(5)

In [71]:
sampler

array([4, 2, 3, 0, 1])

In [72]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [73]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [74]:
# sample 
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [75]:
# generate sample 
chioces = pd.Series([5, 7, -1, 6, 4])

In [76]:
draws = chioces.sample(n=10, replace=True)

In [77]:
draws

3    6
2   -1
2   -1
0    5
2   -1
2   -1
4    4
2   -1
1    7
4    4
dtype: int64

### Computing	Indicator/Dummy	Variables

In [78]:
df = pd.DataFrame({'key': 'b b a c a b'.split(),
                   'data1': range(6)})

In [79]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [80]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [81]:
# add prefix
dummies = pd.get_dummies(df['key'], prefix='key')

In [82]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [83]:
df_with_dummy = df[['data1']].join(dummies)

In [84]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0